artillery-script_25_75.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 300
      arrivalRate: 10
      name: "Simulando 25% Leituras e 75% Escritas"
  variables:
    carId: [1, 2, 3, 4]
    userId: [1, 2, 3]
    brandId: [1, 2]
    countryId: [1, 2]
  http:
    pool: 100

scenarios:
  - flow:
      # 25% Leituras
      - get:
          url: "/cars/{{ carId }}"
      - get:
          url: "/users/{{ userId }}"

      # 75% Escritas
      - post:
          url: "/cars"
          json:
            make: "Ford"
            model: "Mustang"
            year: 2022
            price: 30000
            mileage: 2000
            description: "Sport car in excellent condition"
            ownerId: "{{ userId }}"
            brandId: "{{ brandId }}"
      - post:
          url: "/sales"
          json:
            carId: "{{ carId }}"
            userId: "{{ userId }}"
            price: 35000
      - post:
          url: "/brands"
          json:
            name: "New Brand"
            countryId: "{{ countryId }}"