artillery-script_50_50.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 300
      arrivalRate: 10
      name: "Simulando 50% Leituras e 50% Escritas"
  variables:
    carId: [1, 2, 3, 4]
    userId: [1, 2, 3]
    brandId: [1, 2]
    countryId: [1, 2]
  http:
    pool: 100

scenarios:
  - flow:
      # 50% Leituras
      - get:
          url: "/cars/{{ carId }}"
      - get:
          url: "/users/{{ userId }}"
      - get:
          url: "/brands/{{ brandId }}"
      - get:
          url: "/countries/{{ countryId }}"

      # 50% Escritas
      - post:
          url: "/cars"
          json:
            make: "Toyota"
            model: "Corolla"
            year: 2020
            price: 20000
            mileage: 10000
            description: "Test drive car"
            ownerId: "{{ userId }}"
            brandId: "{{ brandId }}"
      - post:
          url: "/sales"
          json:
            carId: "{{ carId }}"
            userId: "{{ userId }}"
            price: 22000